In [1]:
from pyspark.sql import SparkSession
import pandas as pd

In [2]:
spark = SparkSession.builder.\
    config("spark.jars.packages","saurfang:spark-sas7bdat:2.0.0-s_2.11")\
    .enableHiveSupport().getOrCreate()

In [3]:
fname = '../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat'
df = pd.read_sas(fname, encoding="ISO-8859-1")

In [6]:
df.count()

cicid       3096313
i94yr       3096313
i94mon      3096313
i94cit      3096313
i94res      3096313
i94port     3096313
arrdate     3096313
i94mode     3096074
i94addr     2943941
depdate     2953856
i94bir      3095511
i94visa     3096313
count       3096313
dtadfile    3096312
visapost    1215063
occup          8126
entdepa     3096075
entdepd     2957884
entdepu         392
matflag     2957884
biryear     3095511
dtaddto     3095836
gender      2682044
insnum       113708
airline     3012686
admnum      3096313
fltno       3076764
visatype    3096313
dtype: int64

In [7]:
df.head()

,cicid,i94yr,i94mon,i94cit,i94res,i94port,i94addr,biryear,gender,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,NaN,1979.0,NaN,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,AL,1991.0,M,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,MI,1961.0,M,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,MA,1988.0,NaN,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,MA,2012.0,NaN,B2

In [8]:
df = df[['cicid','i94yr','i94mon','i94cit','i94res','i94port','i94addr','biryear','gender','visatype']]

In [12]:
df = df.fillna(0)
df = df.astype({'cicid':'int32',
           'i94yr':'int32',
           'i94mon':'int32',
           'i94cit':'int32',
           'i94res':'int32',
           'i94port':'object',
           'i94addr':'object',
           'biryear':'int32',
           'gender':'object',
           'visatype':'object'
})
df.dtypes

cicid        int32
i94yr        int32
i94mon       int32
i94cit       int32
i94res       int32
i94port     object
i94addr     object
biryear      int32
gender      object
visatype    object
dtype: object

In [13]:
df.head()

,cicid,i94yr,i94mon,i94cit,i94res,i94port,i94addr,biryear,gender,visatype
0,6,2016,4,692,692,XXX,0,1979,0,B2
1,7,2016,4,254,276,ATL,AL,1991,M,F1
2,15,2016,4,101,101,WAS,MI,1961,M,B2
3,16,2016,4,101,101,NYC,MA,1988,0,B2
4,17,2016,4,101,101,NYC,MA,2012,0,B2

In [14]:
from pyspark.sql.types import *
imgr_schema = StructType([
    StructField('id', IntegerType()),
    StructField('year', IntegerType()),
    StructField('month', IntegerType()),
    StructField('cit', IntegerType()),
    StructField('res', IntegerType()),
    StructField('port', StringType()),
    StructField('addr', StringType()),
    StructField('birth', IntegerType()),
    StructField('gender', StringType()),
    StructField('visa', StringType())
])

In [15]:
df = spark.createDataFrame(df, schema=imgr_schema)

In [22]:
df.select("visa").groupby("visa").count().orderBy("count", ascending=False).show(10)

+----+-------+
|visa|  count|
+----+-------+
|  WT|1309059|
|  B2|1117897|
|  WB| 282983|
|  B1| 212410|
| GMT|  89133|
|  F1|  39016|
|  E2|  19383|
|  CP|  14758|
|  E1|   3743|
|   I|   3176|
+----+-------+
only showing top 10 rows

In [21]:
df.select("visa").distinct().count()

17

In [23]:
df.write.parquet("immigration", mode="overwrite", partitionBy=["cit"])